ba_server/app/controllers/airplanes_controller.rb

SELECT "airplanes".* FROM "airplanes"
---
  def index
    @airplanes = Airplane.all

INSERT INTO "airplanes" ("name", "rows", "columns", "total_seats", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "Plane-1"], ["rows", 3], ["columns", 4], ["total_seats", 12], ["created_at", "2018-04-17 07:32:51.201220"], ["updated_at", "2018-04-17 07:32:51.201220"]]
---
  def create
    @airplane = Airplane.new(airplane_params)

    respond_to do |format|
      if @airplane.save

SELECT  "airplanes".* FROM "airplanes" WHERE "airplanes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_airplane
      @airplane = Airplane.find(params[:id])