ba_server/app/controllers/flights_controller.rb

SELECT "flights".* FROM "flights"
---
  def index
    @flights = Flight.all

SELECT  "flights".* FROM "flights" WHERE "flights"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @flight = Flight.find params[:id]

INSERT INTO "flights" ("flight_no", "origin", "destination", "date", "avail_seats", "airplane_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
    @flight = Flight.new(flight_params)

    respond_to do |format|
      if @flight.save