ba_server/app/controllers/users_controller.rb

INSERT INTO "users" ("email", "user_type", "password", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["email", "m@m.m"], ["user_type", "meena"], ["password", "meena"], ["created_at", "2018-04-17 22:10:52.666855"], ["updated_at", "2018-04-17 22:10:52.666855"]]
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save