ba_server/app/views/flights/_form.html.erb

SELECT "airplanes"."name", "airplanes"."id" FROM "airplanes"
---
    <!-- <%= form.number_field :airplane_id, id: :flight_airplane_id %> -->
    <%= form.select :airplane_id, Airplane.pluck(:name,:id)%>